of90/tutorials/rheoFoam/Cylinder/Oldroyd-BLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type             Oldroyd-BLog;

                rho              rho [1 -3 0 0 0 0 0] 1;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.59;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.41;             
                lambda           lambda [0 0 1 0 0 0 0] 0.7;

                stabilization    coupling;     
                
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}
// ************************************************************************* //
